---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerOptionVisibility
source: html/ad8c2a0f-f6d0-7ffa-7aba-309cf41ed993.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerOptionVisibility Property

"Visible In Option"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerOptionVisibility { get; }
```